#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.vphone_healthy_hosts will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "vphone_healthy_hosts" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:sns:us-east-1:766033189774:slack-topic-alert",
        ] -> (known after apply)
        alarm_description         = "Zero healthy nodes in Target Group"
        alarm_name                = "vphone-healthy-hosts"
        arn                       = "arn:aws:cloudwatch:us-east-1:766033189774:alarm:vphone-healthy-hosts"
        comparison_operator       = "LessThanThreshold"
        datapoints_to_alarm       = 0
        dimensions                = {
            "LoadBalancer" = "app/vphone/8504c6feac3801f3"
            "TargetGroup"  = "targetgroup/vphone/654f9785cf3b9ab8"
        }
        evaluation_periods        = 1
        id                        = "vphone-healthy-hosts"
        insufficient_data_actions = []
        metric_name               = "HealthyHostCount"
        namespace                 = "AWS/ApplicationELB"
      ~ ok_actions                = [
          - "arn:aws:sns:us-east-1:766033189774:slack-topic-alert",
        ] -> (known after apply)
        period                    = 60
        statistic                 = "Sum"
        tags                      = {}
        threshold                 = 1
        treat_missing_data        = "missing"
    }

  # aws_ecs_service.vphone will be updated in-place
  ~ resource "aws_ecs_service" "vphone" {
        cluster                            = "arn:aws:ecs:us-east-1:766033189774:cluster/vphone"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 0
        desired_count                      = 1
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 0
        iam_role                           = "vphone-ecs"
        id                                 = "arn:aws:ecs:us-east-1:766033189774:service/vphone"
        launch_type                        = "EC2"
        name                               = "vphone"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:766033189774:task-definition/vphone:10" -> (known after apply)

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "vphone"
            container_port   = 80
            target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:766033189774:targetgroup/vphone/654f9785cf3b9ab8"
        }
    }

  # aws_ecs_task_definition.vphone must be replaced
-/+ resource "aws_ecs_task_definition" "vphone" {
      ~ arn                      = "arn:aws:ecs:us-east-1:766033189774:task-definition/vphone:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    command                = [
                        "sh",
                        "-c",
                        "/tmp/startup.sh",
                    ]
                    cpu                    = 700
                  + disableNetworking      = null
                  + dnsSearchDomains       = null
                  + dnsServers             = null
                  + dockerLabels           = null
                  + dockerSecurityOptions  = null
                  + entryPoint             = null
                  ~ environment            = [
                      + {
                          + name  = "MYSQL_HOST"
                          + value = "vphone.cxwheu1pocah.us-east-1.rds.amazonaws.com"
                        },
                        {
                            name  = "MYSQL_DATABASE"
                            value = "vphone"
                        },
                      - {
                          - name  = "MYSQL_PASSWORD"
                          - value = "privatesubnetdontcareifleaked"
                        },
                        {
                            name  = "MYSQL_USER"
                            value = "vphone"
                        },
                      ~ {
                          ~ name  = "TIME_FORMAT" -> "MYSQL_PASSWORD"
                          ~ value = "g:i A T" -> "privatesubnetdontcareifleaked"
                        },
                      - {
                          - name  = "MYSQL_HOST"
                          - value = "vphone.cxwheu1pocah.us-east-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DEBUG"
                          - value = "true"
                        },
                      - {
                          - name  = "GOOGLE_MAPS_API_KEY"
                          - value = "AIzaSyAvEBzME35IjvFpYvfEP5H3w-msMBZ2I98"
                        },
                      - {
                          - name  = "BMLT_ROOT_SERVER"
                          - value = "https://bmlt.virtual-na.org/main_server"
                        },
                        {
                            name  = "TITLE"
                            value = "Welcome to the Virtual Meeting Finder, provided by the North Star Group of Narcotics Anonymous"
                        },
                      ~ {
                          ~ name  = "DIGIT_MAP_SEARCH_TYPE" -> "BMLT_ROOT_SERVER"
                          ~ value = "['2' => SearchType::MEETINGS, '3' => SearchType::JFT]" -> "https://bmlt.virtual-na.org/main_server"
                        },
                      ~ {
                          ~ name  = "TWILIO_AUTH_TOKEN" -> "GOOGLE_MAPS_API_KEY"
                          ~ value = "48329780d8f44f009bddc001913fd575" -> "AIzaSyAvEBzME35IjvFpYvfEP5H3w-msMBZ2I98"
                        },
                      + {
                          + name  = "TWILIO_ACCOUNT_SID"
                          + value = "AC34340e47ff9bcc2aa50165a7dde3ac68"
                        },
                      + {
                          + name  = "TWILIO_AUTH_TOKEN"
                          + value = "c46fc28d66f1324d4ae1fefdfed62f3b"
                        },
                        {
                            name  = "CUSTOM_QUERY"
                            value = "&weekdays={DAY}&formats=47&sort_keys=start_time"
                        },
                      ~ {
                          ~ name  = "TWILIO_ACCOUNT_SID" -> "DIGIT_MAP_SEARCH_TYPE"
                          ~ value = "ACe134d10fb87fac1ece9cd9f2c877c9ab" -> "['2' => SearchType::MEETINGS, '3' => SearchType::JFT]"
                        },
                      + {
                          + name  = "TIME_FORMAT"
                          + value = "g:i A T"
                        },
                      + {
                          + name  = "DEBUG"
                          + value = "true"
                        },
                    ]
                    essential              = true
                  + extraHosts             = null
                  + hostname               = null
                    image                  = "766033189774.dkr.ecr.us-east-1.amazonaws.com/vphone:latest"
                    links                  = []
                    linuxParameters        = {
                        initProcessEnabled = true
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "vphone"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "vphone"
                        }
                    }
                    memoryReservation      = 512
                    mountPoints            = []
                    name                   = "vphone"
                    portMappings           = [
                        {
                            containerPort = 80
                            hostPort      = 0
                            protocol      = "tcp"
                        },
                    ]
                  + privileged             = null
                  + readonlyRootFilesystem = null
                  + ulimits                = null
                  + user                   = null
                    volumesFrom            = []
                    workingDirectory       = "/var/www/html"
                } # forces replacement,
            ]
        )
        family                   = "vphone"
      ~ id                       = "vphone" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 10 -> (known after apply)
      - tags                     = {} -> null
    }

  # aws_lb_target_group.vphone will be updated in-place
  ~ resource "aws_lb_target_group" "vphone" {
        arn                                = "arn:aws:elasticloadbalancing:us-east-1:766033189774:targetgroup/vphone/654f9785cf3b9ab8"
        arn_suffix                         = "targetgroup/vphone/654f9785cf3b9ab8"
        deregistration_delay               = 0
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:766033189774:targetgroup/vphone/654f9785cf3b9ab8"
        lambda_multi_value_headers_enabled = false
        load_balancing_algorithm_type      = "round_robin"
        name                               = "vphone"
        port                               = 80
        protocol                           = "HTTP"
        proxy_protocol_v2                  = false
        slow_start                         = 0
        tags                               = {}
        target_type                        = "instance"
        vpc_id                             = "vpc-0b06abcc49c87c31f"

      ~ health_check {
            enabled             = true
            healthy_threshold   = 3
            interval            = 60
            matcher             = "200"
          ~ path                = "/upgrade-advisor.php" -> "/ping.php"
            port                = "traffic-port"
            protocol            = "HTTP"
            timeout             = 5
            unhealthy_threshold = 3
        }

        stickiness {
            cookie_duration = 86400
            enabled         = false
            type            = "lb_cookie"
        }
    }

  # module.notify_slack.aws_lambda_function.notify_slack[0] will be updated in-place
  ~ resource "aws_lambda_function" "notify_slack" {
        arn                            = "arn:aws:lambda:us-east-1:766033189774:function:notify_slack"
        description                    = "Send Alerts to Slack"
        filename                       = ".terraform/modules/notify_slack/terraform-aws-modules-terraform-aws-notify-slack-7d49243/functions/notify_slack.zip"
        function_name                  = "notify_slack"
        handler                        = "notify_slack.lambda_handler"
        id                             = "notify_slack"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:766033189774:function:notify_slack/invocations"
        last_modified                  = "2020-03-29T03:17:49.724+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:766033189774:function:notify_slack:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::766033189774:role/lambda20200329031727240900000001"
        runtime                        = "python3.7"
        source_code_hash               = "abde1EgKW7m1Pg0BKbETwR6iIEX3a/Mdonh6hCdglD8="
        source_code_size               = 1555
        tags                           = {}
        timeout                        = 30
        version                        = "$LATEST"

      ~ environment {
          ~ variables = {
                "LOG_EVENTS"        = "False"
                "SLACK_CHANNEL"     = "virtual-phone"
                "SLACK_EMOJI"       = ":aws:"
                "SLACK_USERNAME"    = "alert-bot"
              ~ "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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" -> ""
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.notify_slack.aws_lambda_permission.sns_notify_slack[0] must be replaced
-/+ resource "aws_lambda_permission" "sns_notify_slack" {
        action        = "lambda:InvokeFunction"
        function_name = "notify_slack"
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
        principal     = "sns.amazonaws.com"
      ~ source_arn    = "arn:aws:sns:us-east-1:766033189774:slack-topic-alert" -> (known after apply) # forces replacement
        statement_id  = "AllowExecutionFromSNS"
    }

  # module.notify_slack.aws_sns_topic.this[0] will be created
  + resource "aws_sns_topic" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "slack-topic-alert"
      + policy = (known after apply)
    }

  # module.notify_slack.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
      ~ arn                             = "arn:aws:sns:us-east-1:766033189774:slack-topic-alert:00892d1f-9dd3-44de-9576-3fd589361e9d" -> (known after apply)
        confirmation_timeout_in_minutes = 1
        endpoint                        = "arn:aws:lambda:us-east-1:766033189774:function:notify_slack"
        endpoint_auto_confirms          = false
      ~ id                              = "arn:aws:sns:us-east-1:766033189774:slack-topic-alert:00892d1f-9dd3-44de-9576-3fd589361e9d" -> (known after apply)
        protocol                        = "lambda"
        raw_message_delivery            = false
      ~ topic_arn                       = "arn:aws:sns:us-east-1:766033189774:slack-topic-alert" -> (known after apply) # forces replacement
    }

Plan: 4 to add, 4 to change, 3 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `/terraform`, Workspace: `default`*
